/*
 * @Author: your name
 * @Date: 2021-09-13 18:53:38
 * @LastEditTime: 2022-11-02 23:41:23
 * @LastEditors: subin 18565641627@163.com
 * @Description: In User Settings Edit
 * @FilePath: /wexin-memorial-day-by-jiji/utils/util.js
 */
const formatTime = (date) => {
    const year = date.getFullYear()
    const month = date.getMonth() + 1
    const day = date.getDate()
    //const hour = date.getHours()
    // const minute = date.getMinutes()
    //const second = date.getSeconds()

    return [year, month, day].map(formatNumber).join('-') //+ ' ' + [hour, minute, second].map(formatNumber).join(':')
}

const formatNumber = (n) => {
    n = n.toString()
    return n[1] ? n : '0' + n
}

const formatTimeTwo = (value, type) => {
    let time = value ? new Date(parseInt(+value)) : new Date()
    if (value.toString().length == 13) {
        time = value ? new Date(parseInt(+value)) : new Date()
    }
    let formatTime = type ? type : 'yyyy-MM-dd hh:mm:ss'
    let date = {
        // "Y+": time.getFullYear(),
        'M+': time.getMonth() + 1,
        'd+': time.getDate(),
        'h+': time.getHours(),
        'm+': time.getMinutes(),
        's+': time.getSeconds(),
        'q+': Math.floor((time.getMonth() + 3) / 3),
        'S+': time.getMilliseconds(),
    }
    if (/(y+)/i.test(formatTime)) {
        formatTime = formatTime.replace(RegExp.$1, (time.getFullYear() + '').substr(4 - RegExp.$1.length))
    }
    for (let k in date) {
        if (new RegExp('(' + k + ')').test(formatTime)) {
            formatTime = formatTime.replace(RegExp.$1, RegExp.$1.length == 1 ? date[k] : ('00' + date[k]).substr(('' + date[k]).length))
        }
    }
    return formatTime
}

// 坐标转换 度°分′秒″转度
function ToDigital(strDu, strFen, strMiao, len) {
    len = len > 6 || typeof len == 'undefined' ? 6 : len //精确到小数点后最多六位
    strDu = typeof strDu == 'undefined' || strDu == '' ? 0 : parseFloat(strDu)
    strFen = typeof strFen == 'undefined' || strFen == '' ? 0 : parseFloat(strFen) / 60
    strMiao = typeof strMiao == 'undefined' || strMiao == '' ? 0 : parseFloat(strMiao) / 3600
    var digital = strDu + strFen + strMiao
    if (digital == 0) {
        return ''
    } else {
        return digital.toFixed(len)
    }
}

function reBackTime(vale) {
    // yyyy-MM-dd HH:mm:ss
    const Times = vale.split(' ')
    return `${Times[0].replace(/:/, '-')} ${Times[1]}`
}

let cityInfo = {
    广东: {
        province_code: 'gd',
        广东: {
            id: '440000',
        },
        广州: {
            id: '440100',
        },
        韶关: {
            id: '440200',
        },
        深圳: {
            id: '440300',
        },
        珠海: {
            id: '440400',
        },
        汕头: {
            id: '440500',
        },
        佛山: {
            id: '440600',
        },
        江门: {
            id: '440700',
        },
        湛江: {
            id: '440800',
        },
        茂名: {
            id: '440900',
        },
        肇庆: {
            id: '441200',
        },
        惠州: {
            id: '441300',
        },
        梅州: {
            id: '441400',
        },
        汕尾: {
            id: '441500',
        },
        河源: {
            id: '441600',
        },
        阳江: {
            id: '441700',
        },
        清远: {
            id: '441800',
        },
        东莞: {
            id: '441900',
        },
        中山: {
            id: '442000',
        },
        潮州: {
            id: '445100',
        },
        揭阳: {
            id: '445200',
        },
        云浮: {
            id: '445300',
        },
    },
    山西: {
        province_code: 'shanxi',
        山西: {
            id: '140000',
        },
        太原: {
            id: '140100',
        },
        大同: {
            id: '140200',
        },
        阳泉: {
            id: '140300',
        },
        长治: {
            id: '140400',
        },
        晋城: {
            id: '140500',
        },
        朔州: {
            id: '140600',
        },
        晋中: {
            id: '140700',
        },
        运城: {
            id: '140800',
        },
        忻州: {
            id: '140900',
        },
        临汾: {
            id: '141000',
        },
        吕梁: {
            id: '141100',
        },
    },
    内蒙古: {
        province_code: 'neimenggu',
        内蒙古: {
            id: '150000',
        },
        呼和浩特: {
            id: '150100',
        },
        包头: {
            id: '150200',
        },
        乌海: {
            id: '150300',
        },
        赤峰: {
            id: '150400',
        },
        通辽: {
            id: '150500',
        },
        鄂尔多斯: {
            id: '150600',
        },
        呼伦贝尔: {
            id: '150700',
        },
        巴彦淖尔: {
            id: '150800',
        },
        乌兰察布: {
            id: '150900',
        },
        兴安盟: {
            id: '152200',
        },
        锡林郭勒盟: {
            id: '152500',
        },
        阿拉善盟: {
            id: '152900',
        },
    },
    北京: {
        province_code: 'bj',
        id: '110000',
        北京: {
            id: '110000',
        },
        朝阳区: {
            id: '110105',
        },
        海淀区: {
            id: '110108',
        },
        昌平区: {
            id: '110114',
        },
        丰台区: {
            id: '110106',
        },
        西城区: {
            id: '110102',
        },
        东城区: {
            id: '110101',
        },
        房山区: {
            id: '110111',
        },
        石景山区: {
            id: '110107',
        },
        大兴区: {
            id: '110115',
        },
        顺义区: {
            id: '110113',
        },
        通州区: {
            id: '110112',
        },
        平谷区: {
            id: '110117',
        },
        怀柔区: {
            id: '110116',
        },
        门头沟区: {
            id: '110109',
        },
        密云区: {
            id: '110118',
        },
        延庆区: {
            id: '110119',
        },
    },
    福建: {
        province_code: 'fj',
        福建: {
            id: '350000',
        },
        福州: {
            id: '350100',
        },
        厦门: {
            id: '350200',
        },
        莆田: {
            id: '350300',
        },
        三明: {
            id: '350400',
        },
        泉州: {
            id: '350500',
        },
        漳州: {
            id: '350600',
        },
        南平: {
            id: '350700',
        },
        龙岩: {
            id: '350800',
        },
        宁德: {
            id: '350900',
        },
    },
    新疆: {
        province_code: 'xinjiang',
        新疆: {
            id: '650000',
        },
        乌鲁木齐: {
            id: '650100',
        },
        克拉玛依: {
            id: '650200',
        },
        吐鲁番: {
            id: '650400',
        },
        哈密: {
            id: '650500',
        },
        昌吉: {
            id: '652300',
        },
        博尔塔拉: {
            id: '652700',
        },
        巴音郭楞: {
            id: '652800',
        },
        阿克苏: {
            id: '652900',
        },
        克孜勒苏柯尔克孜: {
            id: '653000',
        },
        喀什: {
            id: '653100',
        },
        和田: {
            id: '653200',
        },
        伊犁: {
            id: '654000',
        },
        塔城: {
            id: '654200',
        },
        阿勒泰: {
            id: '654300',
        },
        石河子: {
            id: '659001',
        },
        北屯: {
            id: '659005',
        },
    },
    陕西: {
        province_code: 'xian',
        陕西: {
            id: '610000',
        },
        西安: {
            id: '610100',
        },
        铜川: {
            id: '610200',
        },
        宝鸡: {
            id: '610300',
        },
        咸阳: {
            id: '610400',
        },
        渭南: {
            id: '610500',
        },
        延安: {
            id: '610600',
        },
        汉中: {
            id: '610700',
        },
        榆林: {
            id: '610800',
        },
        安康: {
            id: '610900',
        },
        商洛: {
            id: '611000',
        },
    },
    四川: {
        province_code: 'cd',
        四川: {
            id: '510000',
        },
        成都: {
            id: '510100',
        },
        自贡: {
            id: '510300',
        },
        攀枝花: {
            id: '510400',
        },
        泸州: {
            id: '510500',
        },
        德阳: {
            id: '510600',
        },
        绵阳: {
            id: '510700',
        },
        广元: {
            id: '510800',
        },
        遂宁: {
            id: '510900',
        },
        内江: {
            id: '511000',
        },
        乐山: {
            id: '511100',
        },
        南充: {
            id: '511300',
        },
        眉山: {
            id: '511400',
        },
        宜宾: {
            id: '511500',
        },
        广安: {
            id: '511600',
        },
        达州: {
            id: '511700',
        },
        雅安: {
            id: '511800',
        },
        巴中: {
            id: '511900',
        },
        资阳: {
            id: '512000',
        },
        阿坝: {
            id: '513200',
        },
        甘孜: {
            id: '513300',
        },
        凉山: {
            id: '513400',
        },
    },
    湖南: {
        province_code: 'hn',
        湖南: {
            id: '430000',
        },
        长沙: {
            id: '430100',
        },
        株洲: {
            id: '430200',
        },
        湘潭: {
            id: '430300',
        },
        衡阳: {
            id: '430400',
        },
        邵阳: {
            id: '430500',
        },
        岳阳: {
            id: '430600',
        },
        常德: {
            id: '430700',
        },
        张家界: {
            id: '430800',
        },
        益阳: {
            id: '430900',
        },
        郴州: {
            id: '431000',
        },
        永州: {
            id: '431100',
        },
        怀化: {
            id: '431200',
        },
        娄底: {
            id: '431300',
        },
        湘西: {
            id: '433100',
        },
    },
    天津: {
        province_code: 'tj',
        id: '120000',
        天津: {
            id: '120000',
        },
        南开区: {
            id: '120104',
        },
        河北区: {
            id: '120105',
        },
        滨海新区: {
            id: '120116',
        },
        河西区: {
            id: '120103',
        },
        北辰区: {
            id: '120113',
        },
        静海区: {
            id: '120118',
        },
        津南区: {
            id: '120112',
        },
        西青区: {
            id: '120111',
        },
        河东区: {
            id: '120102',
        },
        和平区: {
            id: '120101',
        },
        武清区: {
            id: '120114',
        },
        宝坻区: {
            id: '120115',
        },
        红桥区: {
            id: '120106',
        },
        宁河区: {
            id: '120117',
        },
        东丽区: {
            id: '120110',
        },
        蓟州区: {
            id: '120119',
        },
    },
    河南: {
        province_code: 'henan',
        河南: {
            id: '410000',
        },
        郑州: {
            id: '410100',
        },
        开封: {
            id: '410200',
        },
        洛阳: {
            id: '410300',
        },
        平顶山: {
            id: '410400',
        },
        安阳: {
            id: '410500',
        },
        鹤壁: {
            id: '410600',
        },
        新乡: {
            id: '410700',
        },
        焦作: {
            id: '410800',
        },
        濮阳: {
            id: '410900',
        },
        许昌: {
            id: '411000',
        },
        漯河: {
            id: '411100',
        },
        三门峡: {
            id: '411200',
        },
        南阳: {
            id: '411300',
        },
        商丘: {
            id: '411400',
        },
        信阳: {
            id: '411500',
        },
        周口: {
            id: '411600',
        },
        驻马店: {
            id: '411700',
        },
        济源: {
            id: '419001',
        },
    },
    江苏: {
        province_code: 'jiangsu',
        江苏: {
            id: '320000',
        },
        南京: {
            id: '320100',
        },
        无锡: {
            id: '320200',
        },
        徐州: {
            id: '320300',
        },
        常州: {
            id: '320400',
        },
        苏州: {
            id: '320500',
        },
        南通: {
            id: '320600',
        },
        连云港: {
            id: '320700',
        },
        淮安: {
            id: '320800',
        },
        盐城: {
            id: '320900',
        },
        扬州: {
            id: '321000',
        },
        镇江: {
            id: '321100',
        },
        泰州: {
            id: '321200',
        },
        宿迁: {
            id: '321300',
        },
    },
    云南: {
        province_code: 'yn',
        云南: {
            id: '530000',
        },
        昆明: {
            id: '530100',
        },
        曲靖: {
            id: '530300',
        },
        玉溪: {
            id: '530400',
        },
        保山: {
            id: '530500',
        },
        昭通: {
            id: '530600',
        },
        丽江: {
            id: '530700',
        },
        普洱: {
            id: '530800',
        },
        临沧: {
            id: '530900',
        },
        楚雄: {
            id: '532300',
        },
        红河: {
            id: '532500',
        },
        文山: {
            id: '532600',
        },
        西双版纳: {
            id: '532800',
        },
        大理: {
            id: '532900',
        },
        德宏: {
            id: '533100',
        },
        怒江: {
            id: '533300',
        },
        迪庆: {
            id: '533400',
        },
    },
    浙江: {
        province_code: 'zj',
        浙江: {
            id: '330000',
        },
        杭州: {
            id: '330100',
        },
        宁波: {
            id: '330200',
        },
        温州: {
            id: '330300',
        },
        嘉兴: {
            id: '330400',
        },
        湖州: {
            id: '330500',
        },
        绍兴: {
            id: '330600',
        },
        金华: {
            id: '330700',
        },
        衢州: {
            id: '330800',
        },
        舟山: {
            id: '330900',
        },
        台州: {
            id: '331000',
        },
        丽水: {
            id: '331100',
        },
    },
    西藏: {
        province_code: 'xizang',
        西藏: {
            id: '540000',
        },
        拉萨: {
            id: '540100',
        },
        日喀则: {
            id: '540200',
        },
        昌都: {
            id: '540300',
        },
        林芝: {
            id: '540400',
        },
        山南: {
            id: '540500',
        },
        那曲: {
            id: '540600',
        },
        阿里: {
            id: '542500',
        },
    },
    重庆: {
        province_code: 'cq',
        id: '500000',
        重庆: {
            id: '500000',
        },
        万州区: {
            id: '500101',
        },
        渝北区: {
            id: '500112',
        },
        渝中区: {
            id: '500103',
        },
        沙坪坝区: {
            id: '500106',
        },
        九龙坡区: {
            id: '500107',
        },
        南岸区: {
            id: '500108',
        },
        北碚区: {
            id: '500109',
        },
        江津区: {
            id: '500116',
        },
        南川区: {
            id: '500119',
        },
        綦江区: {
            id: '500110',
        },
        忠县: {
            id: '500233',
        },
        潼南区: {
            id: '500152',
        },
        荣昌区: {
            id: '500153',
        },
        巫山县: {
            id: '500237',
        },
        垫江县: {
            id: '500231',
        },
        云阳县: {
            id: '500235',
        },
        武隆区: {
            id: '500156',
        },
        永川区: {
            id: '500118',
        },
        涪陵区: {
            id: '500102',
        },
        璧山区: {
            id: '500120',
        },
        铜梁区: {
            id: '500151',
        },
        大足区: {
            id: '500111',
        },
        黔江区: {
            id: '500114',
        },
        酉阳土家族苗族自治县: {
            id: '500242',
        },
        巴南区: {
            id: '500113',
        },
        城口县: {
            id: '500229',
        },
        丰都县: {
            id: '500230',
        },
        江北区: {
            id: '500105',
        },
        奉节县: {
            id: '500236',
        },
        合川区: {
            id: '500117',
        },
        大渡口区: {
            id: '500104',
        },
        梁平区: {
            id: '500155',
        },
        巫溪县: {
            id: '500238',
        },
        石柱土家族自治县: {
            id: '500240',
        },
        秀山土家族苗族自治县: {
            id: '500241',
        },
        长寿区: {
            id: '500115',
        },
        彭水苗族土家族自治县: {
            id: '500243',
        },
    },
    上海: {
        province_code: 'sh',
        id: '310000',
        上海: {
            id: '310000',
        },
        静安区: {
            id: '310106',
        },
        徐汇区: {
            id: '310104',
        },
        奉贤区: {
            id: '310120',
        },
        浦东新区: {
            id: '310115',
        },
        闵行区: {
            id: '310112',
        },
        虹口区: {
            id: '310109',
        },
        杨浦区: {
            id: '310110',
        },
        黄浦区: {
            id: '310101',
        },
        崇明区: {
            id: '310151',
        },
        嘉定区: {
            id: '310114',
        },
        普陀区: {
            id: '310107',
        },
        金山区: {
            id: '310116',
        },
        青浦区: {
            id: '310118',
        },
        长宁区: {
            id: '310105',
        },
    },
    辽宁: {
        province_code: 'ln',
        辽宁: {
            id: '210000',
        },
        沈阳: {
            id: '210100',
        },
        大连: {
            id: '210200',
        },
        鞍山: {
            id: '210300',
        },
        抚顺: {
            id: '210400',
        },
        本溪: {
            id: '210500',
        },
        丹东: {
            id: '210600',
        },
        锦州: {
            id: '210700',
        },
        营口: {
            id: '210800',
        },
        阜新: {
            id: '210900',
        },
        辽阳: {
            id: '211000',
        },
        盘锦: {
            id: '211100',
        },
        铁岭: {
            id: '211200',
        },
        朝阳: {
            id: '211300',
        },
        葫芦岛: {
            id: '211400',
        },
    },
    山东: {
        province_code: 'sd',
        山东: {
            id: '370000',
        },
        济南: {
            id: '370100',
        },
        青岛: {
            id: '370200',
        },
        淄博: {
            id: '370300',
        },
        枣庄: {
            id: '370400',
        },
        烟台: {
            id: '370600',
        },
        潍坊: {
            id: '370700',
        },
        济宁: {
            id: '370800',
        },
        泰安: {
            id: '370900',
        },
        威海: {
            id: '371000',
        },
        日照: {
            id: '371100',
        },
        临沂: {
            id: '371300',
        },
        德州: {
            id: '371400',
        },
        聊城: {
            id: '371500',
        },
        菏泽: {
            id: '371700',
        },
    },
    安徽: {
        province_code: 'ah',
        安徽: {
            id: '340000',
        },
        合肥: {
            id: '340100',
        },
        芜湖: {
            id: '340200',
        },
        蚌埠: {
            id: '340300',
        },
        淮南: {
            id: '340400',
        },
        马鞍山: {
            id: '340500',
        },
        淮北: {
            id: '340600',
        },
        铜陵: {
            id: '340700',
        },
        安庆: {
            id: '340800',
        },
        黄山: {
            id: '341000',
        },
        滁州: {
            id: '341100',
        },
        阜阳: {
            id: '341200',
        },
        宿州: {
            id: '341300',
        },
        六安: {
            id: '341500',
        },
        亳州: {
            id: '341600',
        },
        池州: {
            id: '341700',
        },
        宣城: {
            id: '341800',
        },
    },
    黑龙江: {
        province_code: 'heilongjiang',
        黑龙江: {
            id: '230000',
        },
        哈尔滨: {
            id: '230100',
        },
        齐齐哈尔: {
            id: '230200',
        },
        鸡西: {
            id: '230300',
        },
        鹤岗: {
            id: '230400',
        },
        双鸭山: {
            id: '230500',
        },
        大庆: {
            id: '230600',
        },
        伊春: {
            id: '230700',
        },
        佳木斯: {
            id: '230800',
        },
        七台河: {
            id: '230900',
        },
        牡丹江: {
            id: '231000',
        },
        黑河: {
            id: '231100',
        },
        绥化: {
            id: '231200',
        },
        大兴安岭: {
            id: '232700',
        },
    },
    海南: {
        province_code: 'hainan',
        海南: {
            id: '460000',
        },
        海口: {
            id: '460100',
        },
        三亚: {
            id: '460200',
        },
        三沙: {
            id: '460300',
        },
        儋州: {
            id: '460400',
        },
        五指山: {
            id: '469001',
        },
        琼海: {
            id: '469002',
        },
        文昌: {
            id: '469005',
        },
        万宁: {
            id: '469006',
        },
        东方: {
            id: '469007',
        },
        定安: {
            id: '469021',
        },
        屯昌: {
            id: '469022',
        },
        澄迈: {
            id: '469023',
        },
        临高: {
            id: '469024',
        },
        白沙: {
            id: '469025',
        },
        昌江: {
            id: '469026',
        },
        乐东: {
            id: '469027',
        },
        陵水: {
            id: '469028',
        },
        保亭: {
            id: '469029',
        },
        琼中: {
            id: '469030',
        },
    },
    青海: {
        province_code: 'qinghai',
        青海: {
            id: '630000',
        },
        西宁: {
            id: '630100',
        },
        海东: {
            id: '630200',
        },
        海北: {
            id: '632200',
        },
        黄南: {
            id: '632300',
        },
        海南: {
            id: '632500',
        },
        果洛: {
            id: '632600',
        },
        玉树: {
            id: '632700',
        },
        海西蒙古族: {
            id: '632800',
        },
    },
    吉林: {
        province_code: 'jilin',
        吉林: {
            id: '220000',
        },
        长春: {
            id: '220100',
        },
        吉林市: {
            id: '220200',
        },
        四平: {
            id: '220300',
        },
        辽源: {
            id: '220400',
        },
        通化: {
            id: '220500',
        },
        白山: {
            id: '220600',
        },
        松原: {
            id: '220700',
        },
        白城: {
            id: '220800',
        },
        延边: {
            id: '222400',
        },
        公主岭: {
            id: '220381',
        },
    },
    贵州: {
        province_code: 'guizhou',
        贵州: {
            id: '520000',
        },
        贵阳: {
            id: '520100',
        },
        六盘水: {
            id: '520200',
        },
        遵义: {
            id: '520300',
        },
        安顺: {
            id: '520400',
        },
        毕节: {
            id: '520500',
        },
        铜仁: {
            id: '520600',
        },
        黔西南: {
            id: '522300',
        },
        黔东南: {
            id: '522600',
        },
        黔南: {
            id: '522700',
        },
    },
    广西: {
        province_code: 'guangxi',
        广西: {
            id: '450000',
        },
        南宁: {
            id: '450100',
        },
        柳州: {
            id: '450200',
        },
        桂林: {
            id: '450300',
        },
        梧州: {
            id: '450400',
        },
        北海: {
            id: '450500',
        },
        防城港: {
            id: '450600',
        },
        钦州: {
            id: '450700',
        },
        贵港: {
            id: '450800',
        },
        玉林: {
            id: '450900',
        },
        百色: {
            id: '451000',
        },
        贺州: {
            id: '451100',
        },
        河池: {
            id: '451200',
        },
        来宾: {
            id: '451300',
        },
        崇左: {
            id: '451400',
        },
    },
    甘肃: {
        province_code: 'gansu',
        甘肃: {
            id: '620000',
        },
        兰州: {
            id: '620100',
        },
        嘉峪关: {
            id: '620200',
        },
        金昌: {
            id: '620300',
        },
        白银: {
            id: '620400',
        },
        天水: {
            id: '620500',
        },
        武威: {
            id: '620600',
        },
        张掖: {
            id: '620700',
        },
        平凉: {
            id: '620800',
        },
        酒泉: {
            id: '620900',
        },
        庆阳: {
            id: '621000',
        },
        定西: {
            id: '621100',
        },
        陇南: {
            id: '621200',
        },
        临夏: {
            id: '622900',
        },
        甘南: {
            id: '623000',
        },
    },
    湖北: {
        province_code: 'hb',
        湖北: {
            id: '420000',
        },
        武汉: {
            id: '420100',
        },
        黄石: {
            id: '420200',
        },
        十堰: {
            id: '420300',
        },
        宜昌: {
            id: '420500',
        },
        襄阳: {
            id: '420600',
        },
        鄂州: {
            id: '420700',
        },
        荆门: {
            id: '420800',
        },
        孝感: {
            id: '420900',
        },
        荆州: {
            id: '421000',
        },
        黄冈: {
            id: '421100',
        },
        咸宁: {
            id: '421200',
        },
        随州: {
            id: '421300',
        },
        恩施: {
            id: '422800',
        },
        仙桃: {
            id: '429004',
        },
        潜江: {
            id: '429005',
        },
        天门: {
            id: '429006',
        },
        神农架林区: {
            id: '429021',
        },
    },
    宁夏: {
        province_code: 'ningxia',
        宁夏: {
            id: '640000',
        },
        银川: {
            id: '640100',
        },
        石嘴山: {
            id: '640200',
        },
        吴忠: {
            id: '640300',
        },
        固原: {
            id: '640400',
        },
        中卫: {
            id: '640500',
        },
    },
    河北: {
        province_code: 'hebei',
        河北: {
            id: '130000',
        },
        石家庄: {
            id: '130100',
        },
        唐山: {
            id: '130200',
        },
        秦皇岛: {
            id: '130300',
        },
        邯郸: {
            id: '130400',
        },
        邢台: {
            id: '130500',
        },
        保定: {
            id: '130600',
        },
        张家口: {
            id: '130700',
        },
        承德: {
            id: '130800',
        },
        沧州: {
            id: '130900',
        },
        廊坊: {
            id: '131000',
        },
        衡水: {
            id: '131100',
        },
    },
    江西: {
        province_code: 'jiangxi',
        江西: {
            id: '360000',
        },
        南昌: {
            id: '360100',
        },
        景德镇: {
            id: '360200',
        },
        萍乡: {
            id: '360300',
        },
        九江: {
            id: '360400',
        },
        新余: {
            id: '360500',
        },
        鹰潭: {
            id: '360600',
        },
        赣州: {
            id: '360700',
        },
        吉安: {
            id: '360800',
        },
        宜春: {
            id: '360900',
        },
        抚州: {
            id: '361000',
        },
        上饶: {
            id: '361100',
        },
    },
}

module.exports = {
    formatTime: formatTime,
    formatTimeTwo: formatTimeTwo,
    ToDigital: ToDigital,
    reBackTime: reBackTime,
    cityInfo: cityInfo,
}
